ahmedreddead/AVR_ATMEGA_DRIVERS/AVR_DIO_REG.h
/*
 * AVR_DIO_REG.h
 *
 *  Created on: Aug 23, 2019
 *      Author: ahmed
 */

#ifndef AVR_DIO_REG_H_
#define AVR_DIO_REG_H_

#define PORTA *((volatile u8*)0x3B )
#define DDRA *((volatile u8*)0x3A )
#define PINA *((volatile u8*)0x39 )

#define PORTB *((volatile u8*)0x38 )
#define DDRB *((volatile u8*)0x37 )
#define PINB *((volatile u8*)0x36 )

#define PORTC *((volatile u8*)0x35 )
#define DDRC *((volatile u8*)0x34 )
#define PINC *((volatile u8*)0x33 )

#define PORTD *((volatile u8*)0x32 )
#define DDRD *((volatile u8*)0x31 )
#define PIND *((volatile u8*)0x30 )




#define SREG *((volatile u8*)0x5F )
#define SPH *((volatile u8*)0x5E )
#define SPL *((volatile u8*)0x5D )
#define OCR0 *((volatile u8*)0x5C )
#define GICR *((volatile u8*)0x5B )
#define GIFR *((volatile u8*)0x5A )
#define TIMSK *((volatile u8*)0x59 )



#define TIFR *((volatile u8*)0x58 )
#define SPMCR *((volatile u8*)0x57 )
#define TWCR *((volatile u8*)0x56 )
#define MCUCR *((volatile u8*)0x55 )
#define MCUCSR *((volatile u8*)0x54 )
#define TCCR0 *((volatile u8*)0x53 )
#define TCNT0 *((volatile u8*)0x52 )



#define SFIOR *((volatile u8*)0x50 )
#define TCCR1A *((volatile u8*)0x4F )
#define TCCR1B *((volatile u8*)0x4E )
#define TCNT1H *((volatile u8*)0x4D )
#define TCNT1L *((volatile u8*)0x4C )
#define OCR1AH *((volatile u8*)0x4B )
#define OCR1AL *((volatile u8*)0x4A )




#define OCR1BH *((volatile u8*)0x49 )
#define OCR1BL *((volatile u8*)0x48 )
#define ICR1H *((volatile u8*)0x47 )
#define ICR1L *((volatile u8*)0x46 )
#define TCCR2 *((volatile u8*)0x45 )
#define TCNT2 *((volatile u8*)0x44 )


#define OCR2 *((volatile u8*)0x43 )
#define ASSR *((volatile u8*)0x42 )
#define WDTCR *((volatile u8*)0x41 )

#define ADCH *((volatile u8*)0x25 )
#define ADCL *((volatile u8*)0x24 )

#define ADMUX *((volatile u8*)0x27 )
#define ADCSRA *((volatile u8*)0x26 )













#endif /* AVR_DIO_REG_H_ */
